tests/regression/systems/wsdl/wsdlfiles/SatelliteSituationCenterService

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.2_01-hudson-189-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.2_01-hudson-189-. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ssc.spdf.gsfc.nasa.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ssc.spdf.gsfc.nasa.gov/" name="SatelliteSituationCenterService">
<types>
<xsd:schema>
<xsd:import namespace="http://ssc.spdf.gsfc.nasa.gov/" schemaLocation="http://sscweb.gsfc.nasa.gov:80/WS/ssc/2/SatelliteSituationCenterService?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="getData">
<part name="parameters" element="tns:getData"></part>
</message>
<message name="getDataResponse">
<part name="parameters" element="tns:getDataResponse"></part>
</message>
<message name="SSCExternalException">
<part name="fault" element="tns:SSCExternalException"></part>
</message>
<message name="SSCResourceLimitExceededException">
<part name="fault" element="tns:SSCResourceLimitExceededException"></part>
</message>
<message name="getAllSatellites">
<part name="parameters" element="tns:getAllSatellites"></part>
</message>
<message name="getAllSatellitesResponse">
<part name="parameters" element="tns:getAllSatellitesResponse"></part>
</message>
<message name="getGraphs">
<part name="parameters" element="tns:getGraphs"></part>
</message>
<message name="getGraphsResponse">
<part name="parameters" element="tns:getGraphsResponse"></part>
</message>
<message name="getPrivacyAndImportantNotices">
<part name="parameters" element="tns:getPrivacyAndImportantNotices"></part>
</message>
<message name="getPrivacyAndImportantNoticesResponse">
<part name="parameters" element="tns:getPrivacyAndImportantNoticesResponse"></part>
</message>
<message name="getAcknowledgements">
<part name="parameters" element="tns:getAcknowledgements"></part>
</message>
<message name="getAcknowledgementsResponse">
<part name="parameters" element="tns:getAcknowledgementsResponse"></part>
</message>
<message name="getAllSpaseObservatories">
<part name="parameters" element="tns:getAllSpaseObservatories"></part>
</message>
<message name="getAllSpaseObservatoriesResponse">
<part name="parameters" element="tns:getAllSpaseObservatoriesResponse"></part>
</message>
<message name="getAllGroundStations">
<part name="parameters" element="tns:getAllGroundStations"></part>
</message>
<message name="getAllGroundStationsResponse">
<part name="parameters" element="tns:getAllGroundStationsResponse"></part>
</message>
<message name="getDataFiles">
<part name="parameters" element="tns:getDataFiles"></part>
</message>
<message name="getDataFilesResponse">
<part name="parameters" element="tns:getDataFilesResponse"></part>
</message>
<portType name="SatelliteSituationCenterInterface">
<operation name="getData">
<input message="tns:getData"></input>
<output message="tns:getDataResponse"></output>
<fault message="tns:SSCExternalException" name="SSCExternalException"></fault>
<fault message="tns:SSCResourceLimitExceededException" name="SSCResourceLimitExceededException"></fault>
</operation>
<operation name="getAllSatellites">
<input message="tns:getAllSatellites"></input>
<output message="tns:getAllSatellitesResponse"></output>
<fault message="tns:SSCExternalException" name="SSCExternalException"></fault>
</operation>
<operation name="getGraphs">
<input message="tns:getGraphs"></input>
<output message="tns:getGraphsResponse"></output>
<fault message="tns:SSCExternalException" name="SSCExternalException"></fault>
<fault message="tns:SSCResourceLimitExceededException" name="SSCResourceLimitExceededException"></fault>
</operation>
<operation name="getPrivacyAndImportantNotices">
<input message="tns:getPrivacyAndImportantNotices"></input>
<output message="tns:getPrivacyAndImportantNoticesResponse"></output>
<fault message="tns:SSCExternalException" name="SSCExternalException"></fault>
</operation>
<operation name="getAcknowledgements">
<input message="tns:getAcknowledgements"></input>
<output message="tns:getAcknowledgementsResponse"></output>
<fault message="tns:SSCExternalException" name="SSCExternalException"></fault>
</operation>
<operation name="getAllSpaseObservatories">
<input message="tns:getAllSpaseObservatories"></input>
<output message="tns:getAllSpaseObservatoriesResponse"></output>
<fault message="tns:SSCExternalException" name="SSCExternalException"></fault>
</operation>
<operation name="getAllGroundStations">
<input message="tns:getAllGroundStations"></input>
<output message="tns:getAllGroundStationsResponse"></output>
<fault message="tns:SSCExternalException" name="SSCExternalException"></fault>
</operation>
<operation name="getDataFiles">
<input message="tns:getDataFiles"></input>
<output message="tns:getDataFilesResponse"></output>
<fault message="tns:SSCExternalException" name="SSCExternalException"></fault>
<fault message="tns:SSCResourceLimitExceededException" name="SSCResourceLimitExceededException"></fault>
</operation>
</portType>
<binding name="SatelliteSituationCenterPortBinding" type="tns:SatelliteSituationCenterInterface">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="getData">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="SSCExternalException">
<soap:fault name="SSCExternalException" use="literal"></soap:fault>
</fault>
<fault name="SSCResourceLimitExceededException">
<soap:fault name="SSCResourceLimitExceededException" use="literal"></soap:fault>
</fault>
</operation>
<operation name="getAllSatellites">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="SSCExternalException">
<soap:fault name="SSCExternalException" use="literal"></soap:fault>
</fault>
</operation>
<operation name="getGraphs">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="SSCExternalException">
<soap:fault name="SSCExternalException" use="literal"></soap:fault>
</fault>
<fault name="SSCResourceLimitExceededException">
<soap:fault name="SSCResourceLimitExceededException" use="literal"></soap:fault>
</fault>
</operation>
<operation name="getPrivacyAndImportantNotices">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="SSCExternalException">
<soap:fault name="SSCExternalException" use="literal"></soap:fault>
</fault>
</operation>
<operation name="getAcknowledgements">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="SSCExternalException">
<soap:fault name="SSCExternalException" use="literal"></soap:fault>
</fault>
</operation>
<operation name="getAllSpaseObservatories">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="SSCExternalException">
<soap:fault name="SSCExternalException" use="literal"></soap:fault>
</fault>
</operation>
<operation name="getAllGroundStations">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="SSCExternalException">
<soap:fault name="SSCExternalException" use="literal"></soap:fault>
</fault>
</operation>
<operation name="getDataFiles">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="SSCExternalException">
<soap:fault name="SSCExternalException" use="literal"></soap:fault>
</fault>
<fault name="SSCResourceLimitExceededException">
<soap:fault name="SSCResourceLimitExceededException" use="literal"></soap:fault>
</fault>
</operation>
</binding>
<service name="SatelliteSituationCenterService">
<port name="SatelliteSituationCenterPort" binding="tns:SatelliteSituationCenterPortBinding">
<soap:address location="http://sscweb.gsfc.nasa.gov:80/WS/ssc/2/SatelliteSituationCenterService"></soap:address>
</port>
</service>
</definitions>