src/getAllSpaseObservatories.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ssc="http://ssc.spdf.gsfc.nasa.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <ssc:getAllSpaseObservatories/>
   </soapenv:Body>
</soapenv:Envelope>